# Index 다루기 --------------------------------------

- 인덱스의 일부 변경하는 경우 

- 특정 컬럼을 인덱스로 설정하는 경우 

- 기존 인덱스에 새로 추가하는 경우

- 0-base 인덱스로 리셋하는 경우

In [37]:
# 모듈 로딩 -----------------------------------------------
import pandas as pd


# DF 객체 생성 --------------------------------------------
# 성적 DataFrame 객체 생성 --------------------------------
df=pd.DataFrame({'이름': ['서준', '우현','인아'], 
                 '수학': [100,98,99], 
                 '영어': [78,91,56], 
                 '음악': [87,100,91], 
                 '체육': [78,99,100]})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [12]:
# DF의 속성 읽기 -> index, columns, shape
print(df)
print(f'df.index=> {df.index}',f'', f'', sep='\n')

   이름   수학  영어   음악   체육
0  서준  100  78   87   78
1  우현   98  91  100   99
2  인아   99  56   91  100
df.index=> RangeIndex(start=0, stop=3, step=1)

# 특정 컬럼을 인덱스 설정 

- 조건 : 중복 / NaN (Nat a Number) : 빈칸 의미   

- 생성 : DF객체변수명.set_index('컬러명', inplace=False)  <- 기본값
         DF객체변수명.set_index(['컬러명', '컬럼명'], inplace=False)  <- 기본값

In [13]:
# 이름 컬럼 =>  행 인덱스 설정
df1=df.set_index('이름', inplace=True)
print(df1)

None

In [14]:
df.index

Index(['서준', '우현', '인아'], dtype='object', name='이름')

# 인덱스 초기화(리셋) ----------------------------

- 기존의 컬럼 인덱스 => 컬럼 돌려주기
- 메서드 : DF객체변수명.reset_index() => inplace=False 파라미터로 설정

In [17]:
df.reset_index(inplace=True)

In [18]:
df

   이름   수학  영어   음악   체육
0  서준  100  78   87   78
1  우현   98  91  100   99
2  인아   99  56   91  100

In [20]:
# 행(row) 추가 ------------------------------------------
df.loc[3]=['우현', 10, 20, 30, 40]
df

   이름   수학  영어   음악   체육
0  서준  100  78   87   78
1  우현   98  91  100   99
2  인아   99  56   91  100
3  우현   10  20   30   40

In [21]:
# 특정 컬럼 인덱스로 설정
df2=df.set_index(['이름','수학'])
df2

        영어   음악   체육
이름 수학
서준 100  78   87   78
우현 98   91  100   99
인아 99   56   91  100
우현 10   20   30   40

# 인데스 재배열 설정 ----------------------------------

- 기존 인덱스에 변경을 가하는 것

- 원본 적용 inplace =False 기본값

- 메서드 : DF객체변수명.reindex([인덱스 리스트 ], fill_value=값)

In [22]:
df

   이름   수학  영어   음악   체육
0  서준  100  78   87   78
1  우현   98  91  100   99
2  인아   99  56   91  100
3  우현   10  20   30   40

In [23]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [27]:
df1=df.reindex([0,1,2,3,4,5])
df1

    이름     수학    영어     음악     체육
0   서준  100.0  78.0   87.0   78.0
1   우현   98.0  91.0  100.0   99.0
2   인아   99.0  56.0   91.0  100.0
3   우현   10.0  20.0   30.0   40.0
4  NaN    NaN   NaN    NaN    NaN
5  NaN    NaN   NaN    NaN    NaN

In [30]:
df1=df.reindex([0,'a'], fill_value=0)
df1.shape

(2, 5)

In [31]:
df1

   이름   수학  영어  음악  체육
0  서준  100  78  87  78
a   0    0   0   0   0

# 인덱스 & 컬럼 일부분 변경 -------------------------

- 기존 인덱스/컬럼에서 일부분 변경하는 메서드

- DF객체변수명.rename(index={기존:새}, columns={기존:새}, inplace=False)
    - 인덱스명 일부 변경 =>  DF객체변수명.rename(index={기존:새, 기존:새, ..} )
    - 컬럼명 일부 변경 =>  DF객체변수명.rename(columns={기존:새, 기존:새, ..} )

   이름   수학  영어   음악   체육
0  서준  100  78   87   78
1  우현   98  91  100   99
2  인아   99  56   91  100
3  우현   10  20   30   40

In [38]:
# 수학 => MATH, 음악 => MUSIC 으로 변경 --------------------
df.rename(columns={'수학':'MATH', '음악':'MUSIC'})

   이름  MATH  영어  MUSIC   체육
0  서준   100  78     87   78
1  우현    98  91    100   99
2  인아    99  56     91  100